
#+TITLE: HOW TO BECOME A BAYESIAN
#+CATEGORY: Statistics

** optimisation
   http://rea.tech/how-we-optimize-apache-spark-apps/
   - maximizeResourceAllocation
   #+BEGIN_EXAMPLE
   spark.executor.cores = number of CPUs on a worker node
spark.executor.instances = number of worker nodes on a cluster
spark.executor.memory = max memory available on a worker node - overheads
spark.default.parallelism = 2 * number of CPUs in total on worker nodes
   #+END_EXAMPLE
   - manual
     - spark.yarn.executor.memoryOverhead = spark.executor.memory * 0.10
     - spark.executor.memory + spark.yarn.executor.memoryOverhead = memory per node / number of executors per node
     - spark.default.parallelism = spark.executor.instances * spark.executor.cores
     - swarm computation
       - assume 4 cores per executor

          | Name        | Role    | CPU | Exe | Memory   | MxExec    |      IP Address |
          |-------------+---------+-----+-----+----------+-----------+-----------------|
          | tm171lin63  | worker  |   4 |   1 | 8.4 GB   | 8.4 GB    |  135.247.171.63 |
          | tm171lin66  | worker  |   4 |   1 | 12.6 GB  | 12.6 GB   |  135.247.171.66 |
          | tm171lin64  | worker  |   4 |   1 | 12.6 GB  | 12.6 GB   |  135.247.171.64 |
          | tm171lin62  | worker  |   4 |   1 | 12.6 GB  | 12.6 GB   |  135.247.171.62 |
          | tm171lin67  | worker  |   4 |   1 | 12.6 GB  | 12.6 GB   |  135.247.171.67 |
          | tm171lin61  | worker  |   4 |   1 | 14.7 GB  | 14.7 GB   |  135.247.171.61 |
          | tm171lin60  | worker  |   8 |   2 | 29.5 GB  | 14.75 GB  |  135.247.171.60 |
          | tm171lin71  | worker  |   8 |   2 | 16.8 GB  | 8.4 GB    |  135.247.171.71 |
          | tm171lin72  | worker  |   8 |   2 | 16.8 GB  | 8.4 GB    |  135.247.171.72 |
          | tm171lin59  | worker  |   8 |   2 | 25.3 GB  | 12.65 GB  |  135.247.171.59 |
          | tm171lin65  | worker  |   8 |   2 | 12.6 GB  | 6.3 GB    |  135.247.171.65 |
          | tm171lin251 | worker  |   8 |   2 | 16.8 GB  | 8.4 GB    | 135.247.171.251 |
          | tm171lin68  | worker  |   8 |   2 | 8.4 GB   | 4.2 GB    |  135.247.171.68 |
          | tm171lin70  | manager |   8 |   2 | 16.8 GB  | 8.4 GB    |  135.247.171.70 |
          | tm171lin178 | worker  |   8 |   2 | 16.8 GB  | 8.4 GB    | 135.247.171.178 |
          | skroder     | worker  |  32 |   8 | 67.5 GB  | 8.4375 GB | 135.247.171.177 |
          |-------------+---------+-----+-----+----------+-----------+-----------------|
          |             |         | 128 |  32 | 300.8 GB | 9.4 GB    |                 |
         #+TBLFM: @>$3=vsum(@I..@II)::@>$5=vsum(@I..@II)::$4=$3/4::$6=$5/$4


         ##+TBLFM: @>$3=vsum(@I..@II)::@>$5=vmean(@I..@II)::$4=$3/4::$6=$5/$4



   #+BEGIN_SRC
spark.executor.memory = 8G * 0.9
spark.yarn.executor.memoryOverhead = 8G * 0.01
spark.executor.cores = 4
spark.executor.instances = 32
spark.default.parallelism = 32 * 4
   #+END_SRC

